text.org
-*- mode: org; coding: utf-8 -*-
#+OPTIONS:   ^:{}
* Введение в программирования микроконтроллеров на примере отладочной платы STM32L-DISCOVERY

Возникло желание написать что-нибудь под микроконтроллер. В качестве задачи было
решено собрать железку открывающую окно, когда в комнате становится слишком
жарко.

В качестве микроконтроллера была взята отладочная плата STM32L-DISCOVERY, для
начала программирования которой не требуется вообще ничего, кроме USB-miniUSB
провода. Кроме того плата несёт с собой стопку оборудования, явно
предназначенного для быстрого старта: Экран состоящий из шести 14-сегментных
символов, два диода, одна кнопка и один датчик прикосновения (Linear touch
sensor/touchkeys).

Первым делом, конечно же, после покупки подобного устройства надо скачать
документацию к нему. Идём на [[http://www.st.com/web/en/catalog/tools/FM116/SC959/SS1532/PF250990][страницу]] данной платы Самая нужная статья там это
"UM1079: STM32L1 discovery kits: STM32L-DISCOVERY and 32L152CDISCOVERY". В ней
рассказано о том какая переферия куда навешана на этой плате и через какаие пины
ввода-вывода с ней можно работать.

А дальше есть два варианта развития событий. Либо вы как приличный человек
берёте "UM1451: Getting started with software development toolchains for the
STM32L-DISCOVERY and 32L152CDISCOVERY boards" и идёте по ссылке "STSW-STM32072 -
STM32L1 Discovery firmware package (RN0079)", покупаете одну из предложенных
студий для разработки на армовых микроконтроллерах, разворачиваете её,
подключаете приличный набор библиотек из STM32L1 Discovery firmware package,
либо поступаете как фанатик, отказываясь от понятных средств разработки в
пользу свободного тулчайна.

Во втором случае вам всё равно не помешает скачать "STM32L1 Discovery firmware
package", но он понадобится несколько позже.

Сначала же придётся решить другие проблемы. Во первых надо найти документацию
на микроконтроллер. Как мы увидели по первой ссылке у нас в руках либо
STM32L152RBT6, либо STM32L152RCT6. Подробнее можно посмотреть на самом
чипе. 

В первую очередь на [[http://www.st.com/web/catalog/mmc/FM141/SC1544/SS1374/LN1041/PF248820#][странице]] с документацией к этому микроконтроллеру нас
интересует reference manual под названием "RM0038: STM32L100xx, STM32L151xx,
STM32L152xx and STM32L162xx advanced ARM-based 32-bit MCUs". Для начала в этом
документе стоит посмотреть на вторую и третью таблицы, в которых нарисовано куда
в памяти что размещается. Отсюда сразу будет видно, что управление периферией
идёт через регистры отображённые в оперативную память на адреса от 0x4000 0000
до 0xA000 0000, а наши программы будут записываться в адреса 0x0800 0000 и выше.

На этом и так затянувшееся введение стоит закончить.

* Оборудование рабочего места

Как уже было сказано для разработки нам не потребуется ничего, кроме USB -
miniUSB кабеля, но только подключать внешние устройства приматывая провода к
пинам -- удовольствие ниже среднего. Выходом из ситуации будет покупка
[[http://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D0%BA%D0%B5%D1%82%D0%BD%D0%B0%D1%8F_%D0%BF%D0%BB%D0%B0%D1%82%D0%B0][Макетной платы]], а так свой первый модуль вы скорее всего разберёте, как только
доделаете, чтобы попробовать использовать отладочную плату как-нибудь ещё, то
лучше всего брать отладочную плату без пайки и стопку соединительных проводов
к ней. Дополнительно иногда хочется проверять наличие-отсутствие сигнала на тех
или иных пинах или, например, силу тока на участках цепи. Для этого берётся
мультиметр.

Кроме оборудования надо найти программу для прошивки данного
устройства. Быстрый поиск по запросу "st link open source" выдал мне вот [[https://github.com/texane/stlink/][такую]]
ссылку. Оттуда можно взять и скомпилировать программу работающую с st link'ом и
умеющую как прошивать через него, так и запускать отладчик.

И последней необходимой программой будет gcc, умеющий arm в качестве целевой
платформы. Чтобы не заморачиваться и с его сборкой я просто установил
gcc-arm-none-eabi вместе с gdb-arm-none-eabi из репозиториев дебиана. Кроме
того, если вы устанавливаете gcc-arm-none-eabi из репозиториев дебиана --
убедитесь, что libnewlib-arm-none-eabi тоже установилась, иначе вы сможете
компилировать только самые простые программы (у вас, к примеру, не будет
арифметики с плавающей точкой) и только с ключом -ffreestanding, который говорит
gcc компилировать программу без поддержки libc.

Осталось проверить работает ли это всё. Для проверки используем "STM32L1
Discovery firmware package" о котором говорилось выше. В связи с тем, что
ставить проприетарные студии я не стал, а пытаться извлечь из их проектов
правила сборки -- слишком муторно, то воспользуемся уже собранными бинарниками
официальных примеров. На свежей плате уже запущено приложение
"AN3413-Current_consumption_touch_sensing", которое лежит в
"STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects", так что прошьём устройство
второй тестовой программой.

Переходим в каталог с бинарником
"STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects/AN3964-Temperature_sensor/Binary"
и переводим бинарник из формата ihex в формат понятный нашему только что
собранному st-util:

> arm-none-eabi-objcopy -Iihex -obinary STM32L-Discovery.hex STM32L-Discovery.bin

И зальём в плату эту программу

> st-flash write STM32L-Discovery.bin 0x08000000

Откуда взялось 0x08000000 было сказано выше. Это адрес с которого должна
размещаться наша программа.

Теперь устройство должно показывать температуру процессора, вместо напряжения и
мощности, которые оно показывало изначально.

