text.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>-*- mode: org; coding: utf-8 -*-</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-02-15 16:05:27 YEKT"/>
<meta name="author" content="Nikolay Merinov"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">-*- mode: org; coding: utf-8 -*-</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Введение в программирования микроконтроллеров на примере отладочной платы STM32L-DISCOVERY </a></li>
<li><a href="#sec-2">2 Оборудование рабочего места </a></li>
<li><a href="#sec-3">3 Первые попытки управления </a>
<ul>
<li><a href="#sec-3.1">3.1 Что значат команды сборки. </a></li>
<li><a href="#sec-3.2">3.2 Что значит код </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Замена адресов портов их именами </a></li>
<li><a href="#sec-5">5 Работа с кнопкой через прерывания. </a></li>
<li><a href="#sec-6">6 Навешивание внешнего оборудования </a>
<ul>
<li><a href="#sec-6.1">6.1 LED экран </a></li>
<li><a href="#sec-6.2">6.2 Подключение светодиодов </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Промежуточный результат </a></li>
<li><a href="#sec-8">8 1-Wire через USART </a></li>
<li><a href="#sec-9">9 ШИМ для управления сервоприводом. </a></li>
<li><a href="#sec-10">10 Результат </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Введение в программирования микроконтроллеров на примере отладочной платы STM32L-DISCOVERY </h2>
<div class="outline-text-2" id="text-1">


<p>
Возникло желание написать что-нибудь под микроконтроллер. В качестве задачи было
решено собрать железку открывающую окно, когда в комнате становится слишком
жарко.
</p>
<p>
В качестве микроконтроллера была взята отладочная плата STM32L-DISCOVERY, для
начала программирования которой не требуется вообще ничего, кроме USB-miniUSB
провода. Кроме того плата несёт с собой стопку оборудования, явно
предназначенного для быстрого старта: Экран состоящий из шести 14-сегментных
символов, два диода, одна кнопка и один датчик прикосновения (Linear touch
sensor/touchkeys).
</p>
<p>
Первым делом, конечно же, после покупки подобного устройства надо скачать
документацию к нему. Идём на <a href="http://www.st.com/web/en/catalog/tools/FM116/SC959/SS1532/PF250990">страницу</a> данной платы Самая нужная статья там это
"UM1079: STM32L1 discovery kits: STM32L-DISCOVERY and 32L152CDISCOVERY". В ней
рассказано о том какая переферия куда навешана на этой плате и через какаие пины
ввода-вывода с ней можно работать.
</p>
<p>
А дальше есть два варианта развития событий. Либо вы как приличный человек
берёте "UM1451: Getting started with software development toolchains for the
STM32L-DISCOVERY and 32L152CDISCOVERY boards" и идёте по ссылке "STSW-STM32072 -
STM32L1 Discovery firmware package (RN0079)", покупаете одну из предложенных
студий для разработки на армовых микроконтроллерах, разворачиваете её,
подключаете приличный набор библиотек из STM32L1 Discovery firmware package,
либо поступаете как фанатик, отказываясь от понятных средств разработки в
пользу свободного тулчайна.
</p>
<p>
Во втором случае вам всё равно не помешает скачать "STM32L1 Discovery firmware
package", но он понадобится несколько позже.
</p>
<p>
Сначала же придётся решить другие проблемы. Во первых надо найти документацию
на микроконтроллер. Как мы увидели по первой ссылке у нас в руках либо
STM32L152RBT6, либо STM32L152RCT6. Подробнее можно посмотреть на самом
чипе. 
</p>
<p>
В первую очередь на <a href="http://www.st.com/web/catalog/mmc/FM141/SC1544/SS1374/LN1041/PF248820#">странице</a> с документацией к этому микроконтроллеру нас
интересует reference manual под названием "RM0038: STM32L100xx, STM32L151xx,
STM32L152xx and STM32L162xx advanced ARM-based 32-bit MCUs". Для начала в этом
документе стоит посмотреть на вторую и третью таблицы, в которых нарисовано куда
в памяти что размещается. Отсюда сразу будет видно, что управление периферией
идёт через регистры отображённые в оперативную память на адреса от 0x4000 0000
до 0xA000 0000, а наши программы будут записываться в адреса 0x0800 0000 и выше.
</p>
<p>
На этом и так затянувшееся введение стоит закончить.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Оборудование рабочего места </h2>
<div class="outline-text-2" id="text-2">


<p>
Как уже было сказано для разработки нам не потребуется ничего, кроме USB -
miniUSB кабеля, но только подключать внешние устройства приматывая провода к
пинам &ndash; удовольствие ниже среднего. Выходом из ситуации будет покупка
<a href="http://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D0%BA%D0%B5%D1%82%D0%BD%D0%B0%D1%8F_%D0%BF%D0%BB%D0%B0%D1%82%D0%B0">Макетной платы</a>, а так свой первый модуль вы скорее всего разберёте, как только
доделаете, чтобы попробовать использовать отладочную плату как-нибудь ещё, то
лучше всего брать отладочную плату без пайки и стопку соединительных проводов
к ней. Дополнительно иногда хочется проверять наличие-отсутствие сигнала на тех
или иных пинах или, например, силу тока на участках цепи. Для этого берётся
мультиметр.
</p>
<p>
Кроме оборудования надо найти программу для прошивки данного
устройства. Быстрый поиск по запросу "st link open source" выдал мне вот <a href="https://github.com/texane/stlink/">такую</a>
ссылку. Оттуда можно взять и скомпилировать программу работающую с st link'ом и
умеющую как прошивать через него, так и запускать отладчик.
</p>
<p>
И последней необходимой программой будет gcc, умеющий arm в качестве целевой
платформы. Чтобы не заморачиваться и с его сборкой я просто установил
gcc-arm-none-eabi вместе с gdb-arm-none-eabi из репозиториев дебиана. Кроме
того, если вы устанавливаете gcc-arm-none-eabi из репозиториев дебиана
запомните, что без libnewlib-arm-none-eabi &ndash; gcc не сможет собирать приложения,
требующие методы из libc, а код придётся собирать с ключом -ffreestanding,
который говорит gcc компилировать программу без поддержки libc.
</p>
<p>
Осталось проверить работает ли это всё. Для проверки используем "STM32L1
Discovery firmware package" о котором говорилось выше. В связи с тем, что
ставить проприетарные студии я не стал, а пытаться извлечь из их проектов
правила сборки &ndash; слишком муторно, то воспользуемся уже собранными бинарниками
официальных примеров. На свежей плате уже запущено приложение
"AN3413-Current_consumption_touch_sensing", которое лежит в
"STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects", так что прошьём устройство
второй тестовой программой.
</p>
<p>
Переходим в каталог с бинарником
"STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects/AN3964-Temperature_sensor/Binary"
и переводим бинарник из формата ihex в формат понятный нашему только что
собранному st-util:
</p>
<p>
&gt; arm-none-eabi-objcopy -Iihex -obinary STM32L-Discovery.hex STM32L-Discovery.bin
</p>
<p>
И зальём в плату эту программу
</p>
<p>
&gt; st-flash write STM32L-Discovery.bin 0x08000000
</p>
<p>
Откуда взялось 0x08000000 было сказано выше. Это адрес с которого должна
размещаться наша программа.
</p>
<p>
Теперь устройство должно показывать температуру процессора, вместо напряжения и
мощности, которые оно показывало изначально.
</p>
</div>

</div>
