text.org
* Первые попытки управления

Когда мы знаем, что у нас есть полностью рабочее окружения для программирования
данного девайса. Самый простой первый шаг -- это помигать диодом. А учитывая,
что так считают все, то можно попытаться найти человека, который мигал диодами,
не используя ST'шные библиотеки.

Поиск выдал [[http://sourcegate.wordpress.com/category/stm32l-discovery/page/2/][блог]] парня, который уже имел опыт программирования avr'ов и начинал
знакомство с данной платой. Сразу позаимствуем, слегка видоизменив, у него код
(который и он собирал из разных источников):

#+BEGIN_SRC c
// By Wolfgang Wieser, heavily based on:
// http://fun-tech.se/stm32/OlimexBlinky/mini.php
// With parts from
// http://sourcegate.wordpress.com/2012/09/20/how-the-stm32l-discovery-demo-works/
#include <stdint.h>
#define STACK_TOP 0x20000800   // just a tiny stack for demo

static void nmi_handler(void);
static void hardfault_handler(void);
int main(void);

// Define the vector table
unsigned int *myvectors[4]
__attribute__ ((section("vectors"))) = {
    (unsigned int *) STACK_TOP,         // stack pointer
    (unsigned int *) main,              // code entry point
    (unsigned int *) nmi_handler,       // NMI handler (not really)
    (unsigned int *) hardfault_handler  // hard fault handler
};

int main(void)
{
    *((uint32_t*) 0x4002381C) = 0x00000002; /* Enable GPIO clock */
    *((uint32_t*) 0x40020400) = 0x00005000; /* Output mode */
    *((uint32_t*) 0x40020418) = 0x00000080; /* LED on */
    int i=0;

    for(;;)
    {
        i++;
    }
}

void nmi_handler(void)
{
    for(;;);
}

void hardfault_handler(void)
{
    for(;;);
}
#+END_SRC

Для компиляции потребуется уже установленный arm-none-eabi-gcc и линковочный
скрипт, который мы, также как в [[http://sourcegate.wordpress.com/2012/09/18/getting-started-with-an-stm32l-discovery-with-linux-and-gcc/][блоге]] возьмём из [[https://raw.github.com/Nomados/STM32F4Discovery-ethernet-PHY-DP83848-demo-ChibiOS/master/ch/os/ports/GCC/ARMCMx/STM32L1xx/ld/STM32L152xB.ld][ChibiOS]]. Скомпилируем программу
и зальём на наше устройство:

#+BEGIN_VERSE
 > arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -mthumb -c -o main.o main.c
 > arm-none-eabi-ld -TSTM32L152xB.ld -nostartfiles -o demo.elf main.o
 > arm-none-eabi-objcopy -Obinary demo.elf demo.bin
 > st-flash write ./demo.bin 0x8000000
#+END_VERSE

Устройство запустилось и зелёный светодиод загорелся. Теперь поймём что значили
все наши действия.

** Что значат команды сборки.

#+BEGIN_VERSE
 > arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -mthumb -c -o main.o main.c
#+END_VERSE

 + "-O0"
   отключает оптимизации и позволяет нам надеяться, что gcc не удалит наш вечный цикл.
 + "-g"
   включает отладочную информацию в файл.
 + "-mcpu=cortex-m3"
   выставляет модель используемого армового процессора.
 + "-mthumb" 
   заставляет использовать gcc набор инструкций thumb вместо набора
   arm. Без этого ключа компилятор скажет что-то вроде "error: target CPU does
   not support ARM mode"
 + "-c" отключает линковку сразу после сборки


#+BEGIN_VERSE
 > arm-none-eabi-ld -TSTM32L152xB.ld -nostartfiles -o demo.elf main.o
#+END_VERSE

 + "-TSTM32L152xB.ld"
   указыват линковщику на скрипт, в котором описаны правила размещения секций кода
   и данных в памяти.  
 + "-nostartfiles" отключает использование стандартных
   функций запускающихся перед main'ом.

#+BEGIN_VERSE
 > arm-none-eabi-objcopy -Obinary demo.elf demo.bin
 > st-flash write ./demo.bin 0x8000000
#+END_VERSE

Эти две команды уже обсуждались в предыдущем разделе.

** Что значит код

Во первых видя

#+BEGIN_SRC c
// Define the vector table
unsigned int *myvectors[4]
__attribute__ ((section("vectors"))) = {
    (unsigned int *) STACK_TOP,         // stack pointer
    (unsigned int *) main,              // code entry point
    (unsigned int *) nmi_handler,       // NMI handler (not really)
    (unsigned int *) hardfault_handler  // hard fault handler
};
#+END_SRC

Мы сразу можем сказать, что где-то в памяти (где конкретно можно посмотреть в
документации, либо в файле линковочного скрипта STM32L152xB.ld) находится
область векторов, в первых четырёх позициях которой указываются начальный адрес
стека, точка входа в программу и обработчики двух прерываний.

И второй не очевидный кусок кода:

#+BEGIN_SRC c
    *((uint32_t*) 0x4002381C) = 0x00000002; /* Enable GPIO clock */
    *((uint32_t*) 0x40020400) = 0x00005000; /* Output mode */
    *((uint32_t*) 0x40020418) = 0x00000080; /* LED on */
#+END_SRC

Для того чтобы выяснить, что происходит тут -- придётся зарываться в
документацию. А именно в Reference manual под названием "RM0038: STM32L100xx,
STM32L151xx, STM32L152xx and STM32L162xx advanced ARM-based 32-bit MCUs".

Пойдём построчно и будем искать какие регистры обозначают использованные адреса
памяти. 

Адрес 0x4002381C попадает в интервал 0x40023800 - 0x40023BFF где находятся RCC
регистры. Смещение от начального адреса у него 0x4002381C - 0x40023800 = 0x1C.
Это регистр RCC_AHBENR. Что нам говорит о нём документация:

#+BEGIN_VERSE
 > When the peripheral clock is not active, the peripheral register values may 
 > not be readable by software and the returned value is always 0x0.
#+END_VERSE

Таким образом пока мы не включим часы -- переферия будет программно
недоступна. При инициализации регистра значением 0x00000002 -- выставляется
первый бит регистра, который отвечает за 'GPIO port B clock enable', то есть за
возможность работать со всеми PBx пинами на отладочной плате.


Ищем адрес 0x40020400 из второй строчки. Это оказывается регистр со смещением
0x0 из блока 0x4002 0400 - 0x4002 07FF управляющего GPIOB -- той самой
периферии, для которой мы только что включили часы. Документация говорит, что
по этому адресу находится GPIOB_MODER регистр, который говорит в каком
конкретно режиме находится каждый из PBx пинов. Когда мы присваиваем ему
значение 0x00005000 мы устанавливаем 12 и 14 биты в 1, а следовательно PB6 и
PB7 в режим General purpose output mode.


Последний адрес 0x40020418 попадает в ту же группу GPIOB регистров, со
смещением 0x18 -- GPIOB_BSRR регистр, половина которого отведена для установки
битов в GPIOB_ODR регистре, а половина для их удаления. GPIOB_ODR же в свою
очередь в соответствии с названием (output data register) говорит на какой
выход будет подаваться единица (на пин подастся напряжение), а на какой -- нет
(напряжения, соответственно не будет). Таким образом запись числа 0x00000080 по
адресу 0x40020418 устанавливает значение PB7 единицу, благодаря чему на диод
подаётся напряжение и он начинает светиться.

Таким образом мы можем управлять диодиками и собирать гирлянды. 

