text.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Первые попытки управления </h2>
<div class="outline-text-2" id="text-3">


<p>
Когда мы знаем, что у нас есть полностью рабочее окружения для программирования
данного девайса. Самый простой первый шаг &ndash; это помигать диодом. А учитывая,
что так считают все, то можно попытаться найти человека, который мигал диодами,
не используя ST'шные библиотеки.
</p>
<p>
Поиск выдал <a href="http://sourcegate.wordpress.com/category/stm32l-discovery/page/2/">блог</a> парня, который уже имел опыт программирования avr'ов и начинал
знакомство с данной платой. Сразу позаимствуем, слегка видоизменив, у него код
(который и он собирал из разных источников):
</p>



<pre class="example">// By Wolfgang Wieser, heavily based on:
// http://fun-tech.se/stm32/OlimexBlinky/mini.php
// With parts from
// http://sourcegate.wordpress.com/2012/09/20/how-the-stm32l-discovery-demo-works/
#include &lt;stdint.h&gt;
#define STACK_TOP 0x20000800   // just a tiny stack for demo

static void nmi_handler(void);
static void hardfault_handler(void);
int main(void);

// Define the vector table
unsigned int *myvectors[4]
__attribute__ ((section("vectors"))) = {
    (unsigned int *) STACK_TOP,         // stack pointer
    (unsigned int *) main,              // code entry point
    (unsigned int *) nmi_handler,       // NMI handler (not really)
    (unsigned int *) hardfault_handler  // hard fault handler
};

int main(void)
{
    *((uint32_t*) 0x4002381C) = 0x00000002; /* Enable GPIO clock */
    *((uint32_t*) 0x40020400) = 0x00005000; /* Output mode */
    *((uint32_t*) 0x40020418) = 0x00000080; /* LED on */
    int i=0;

    for(;;)
    {
        i++;
    }
}

void nmi_handler(void)
{
    for(;;);
}

void hardfault_handler(void)
{
    for(;;);
}
</pre>




<p>
Для компиляции потребуется уже установленный arm-none-eabi-gcc и линковочный
скрипт, который мы, также как в <a href="http://sourcegate.wordpress.com/2012/09/18/getting-started-with-an-stm32l-discovery-with-linux-and-gcc/">блоге</a> возьмём из <a href="https://raw.github.com/Nomados/STM32F4Discovery-ethernet-PHY-DP83848-demo-ChibiOS/master/ch/os/ports/GCC/ARMCMx/STM32L1xx/ld/STM32L152xB.ld">ChibiOS</a>. Скомпилируем программу
и зальём на наше устройство:
</p>

<p class="verse">
&gt; arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -mthumb -c -o main.o main.c<br/>
&gt; arm-none-eabi-ld -TSTM32L152xB.ld -nostartfiles -o demo.elf main.o<br/>
&gt; arm-none-eabi-objcopy -Obinary demo.elf demo.bin<br/>
&gt; st-flash write ./demo.bin 0x8000000<br/>
</p>


<p>
Устройство запустилось и зелёный светодиод загорелся. Теперь поймём что значили
все наши действия.
</p>

</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Что значат команды сборки. </h3>
<div class="outline-text-3" id="text-3.1">



<p class="verse">
&gt; arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -mthumb -c -o main.o main.c<br/>
</p>


<ul>
<li>
"-O0"
отключает оптимизации и позволяет нам надеяться, что gcc не удалит наш вечный цикл.
</li>
<li>
"-g"
включает отладочную информацию в файл.
</li>
<li>
"-mcpu=cortex-m3"
выставляет модель используемого армового процессора.
</li>
<li>
"-mthumb" 
заставляет использовать gcc набор инструкций thumb вместо набора
arm. Без этого ключа компилятор скажет что-то вроде "error: target CPU does
not support ARM mode"
</li>
<li>
"-c" отключает линковку сразу после сборки


</li>
</ul>


<p class="verse">
&gt; arm-none-eabi-ld -TSTM32L152xB.ld -nostartfiles -o demo.elf main.o<br/>
</p>


<ul>
<li>
"-TSTM32L152xB.ld"
указыват линковщику на скрипт, в котором описаны правила размещения секций кода
и данных в памяти.  
</li>
<li>
"-nostartfiles" отключает использование стандартных
функций запускающихся перед main'ом.

</li>
</ul>


<p class="verse">
&gt; arm-none-eabi-objcopy -Obinary demo.elf demo.bin<br/>
&gt; st-flash write ./demo.bin 0x8000000<br/>
</p>


<p>
Эти две команды уже обсуждались в предыдущем разделе.
</p>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Что значит код </h3>
<div class="outline-text-3" id="text-3.2">


<p>
Во первых видя
</p>



<pre class="example">// Define the vector table
unsigned int *myvectors[4]
__attribute__ ((section("vectors"))) = {
    (unsigned int *) STACK_TOP,         // stack pointer
    (unsigned int *) main,              // code entry point
    (unsigned int *) nmi_handler,       // NMI handler (not really)
    (unsigned int *) hardfault_handler  // hard fault handler
};
</pre>




<p>
Мы сразу можем сказать, что где-то в памяти (где конкретно можно посмотреть в
документации, либо в файле линковочного скрипта STM32L152xB.ld) находится
область векторов, в первых четырёх позициях которой указываются начальный адрес
стека, точка входа в программу и обработчики двух прерываний.
</p>
<p>
И второй не очевидный кусок кода:
</p>



<pre class="example">*((uint32_t*) 0x4002381C) = 0x00000002; /* Enable GPIO clock */
*((uint32_t*) 0x40020400) = 0x00005000; /* Output mode */
*((uint32_t*) 0x40020418) = 0x00000080; /* LED on */
</pre>




<p>
Для того чтобы выяснить, что происходит тут &ndash; придётся зарываться в
документацию. А именно в Reference manual под названием "RM0038: STM32L100xx,
STM32L151xx, STM32L152xx and STM32L162xx advanced ARM-based 32-bit MCUs".
</p>
<p>
Пойдём построчно и будем искать какие регистры обозначают использованные адреса
памяти. 
</p>
<p>
Адрес 0x4002381C попадает в интервал 0x40023800 - 0x40023BFF где находятся RCC
регистры. Смещение от начального адреса у него 0x4002381C - 0x40023800 = 0x1C.
Это регистр RCC_AHBENR. Что нам говорит о нём документация:
</p>

<p class="verse">
&gt; When the peripheral clock is not active, the peripheral register values may <br/>
&gt; not be readable by software and the returned value is always 0x0.<br/>
</p>


<p>
Таким образом пока мы не включим часы &ndash; переферия будет программно
недоступна. При инициализации регистра значением 0x00000002 &ndash; выставляется
первый бит регистра, который отвечает за 'GPIO port B clock enable', то есть за
возможность работать со всеми PBx пинами на отладочной плате.
</p>

<p>
Ищем адрес 0x40020400 из второй строчки. Это оказывается регистр со смещением
0x0 из блока 0x4002 0400 - 0x4002 07FF управляющего GPIOB &ndash; той самой
периферии, для которой мы только что включили часы. Документация говорит, что
по этому адресу находится GPIOB_MODER регистр, который говорит в каком
конкретно режиме находится каждый из PBx пинов. Когда мы присваиваем ему
значение 0x00005000 мы устанавливаем 12 и 14 биты в 1, а следовательно PB6 и
PB7 в режим General purpose output mode.
</p>

<p>
Последний адрес 0x40020418 попадает в ту же группу GPIOB регистров, со
смещением 0x18 &ndash; GPIOB_BSRR регистр, половина которого отведена для установки
битов в GPIOB_ODR регистре, а половина для их удаления. GPIOB_ODR же в свою
очередь в соответствии с названием (output data register) говорит на какой
выход будет подаваться единица (на пин подастся напряжение), а на какой &ndash; нет
(напряжения, соответственно не будет). Таким образом запись числа 0x00000080 по
адресу 0x40020418 устанавливает значение PB7 единицу, благодаря чему на диод
подаётся напряжение и он начинает светиться.
</p>
<p>
Таким образом мы можем управлять диодиками и собирать гирлянды. 
</p>
</div>
</div>

</div>
