text.org
* Замена адресов портов их именами

Самое время избавиться от адресов и начать работать с именами. Можно, конечно,
взять документацию и начать сверху вниз забивать все адреса, но это достаточно
муторно. По этому пойдём по пути наименьшего сопротивления и воспользуемся
заголовочными файлами из "STM32L1 Discovery firmware package". Главным
заголовочным файлом там, как видно из примеров идущих в каталоге Projects/
является файл stm32l1xx.h. Подключим его в нашем исходнике и в строку компиляции
добавим 

#+BEGIN_VERSE
-I path/to/STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Device/ST/STM32L1xx/Include/
#+END_VERSE

При попытке скомпилировать получим ошибку

#+BEGIN_VERSE
stm32l1xx.h:266:22: fatal error: core_cm3.h: No such file or directory
 #include "core_cm3.h"
                      ^
compilation terminated.
#+END_VERSE

Найдем этот хэдер и добавим путь к нему в ключи компилятора. Таким образом
компиляция теперь будет проходить при помощи команды:

#+BEGIN_VERSE
arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -c -o main.o main.c -Wall -mthumb \
  -I path/to/STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Device/ST/STM32L1xx/Include/ \
  -I../STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Include/
#+END_VERSE

Благодаря чему мы можем переписать код в более понятном виде:

#+BEGIN_SRC c
#include <stm32l1xx.h>
#include <stdint.h>
#include <stdbool.h>
#define STACK_TOP 0x20004000 // End of memory

void nmi_handler (void);
void hardfault_handler (void);
void delay (void);
int main (void);

/* vector table, according to reference documentaion, occupied 61 pointer-sized cells  */
unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler
};

int
main (void)
{
  int n = 0;
  int i = 0;

  /* Enable GPIOA, GPIOB */
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN;
  /* Set GPIOB Pin 6 and Pin 7 to outputs */
  GPIOB->MODER |= GPIO_MODER_MODER6_0 | GPIO_MODER_MODER7_0;
  /* Set GPIOA Pin 0 to input */
  GPIOA->MODER &= ~GPIO_MODER_MODER0;

  /* PB6 and PB7 is OFF */
  GPIOB->BSRRH |= 1 << 6 | 1 << 7; 


  while (1)
    {
      for (i = 0; i < 800; i++)
	delay ();

      n++;			/* Count the delays */
      if (n & 1)		/* 1 / 1 ticks */
      	{
      	  GPIOB->BSRRL = 1 << 6;
      	}
      else
      	{
      	  GPIOB->BSRRH = 1 << 6;
      	}
      if ((n & 2) && ((GPIOA->IDR & 1) == 0))  /* 2 / 2 ticks, but only when button not pressed */
      	{
      	  GPIOB->BSRRL = 1 << 7;
      	}
      else
      	{
      	  GPIOB->BSRRH = 1 << 7;
      	}
    }
}

void
delay (void)
{
  int i = 80;
  while (i-- > 0)
    {
      asm ("nop");		/* This stops it optimising code out */
    }
}

void
nmi_handler (void)
{
  return;
}

void
hardfault_handler (void)
{
  return;
}
#+END_SRC

Теперь код стал намного яснее и внимательный читатель сразу заметит, что в него
была добавлена обработка кнопки, которая в используемой отладочной плате
запаяна на PA0 пин. Следующим шагом станет попытка использовать прерывания.

