text.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Замена адресов портов их именами </h2>
<div class="outline-text-2" id="text-4">


<p>
Самое время избавиться от адресов и начать работать с именами. Можно, конечно,
взять документацию и начать сверху вниз забивать все адреса, но это достаточно
муторно. По этому пойдём по пути наименьшего сопротивления и воспользуемся
заголовочными файлами из "STM32L1 Discovery firmware package". Главным
заголовочным файлом там, как видно из примеров идущих в каталоге Projects/
является файл stm32l1xx.h. Подключим его в нашем исходнике и в строку компиляции
добавим 
</p>

<p class="verse">
-I path/to/STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Device/ST/STM32L1xx/Include/<br/>
</p>


<p>
При попытке скомпилировать получим ошибку
</p>

<p class="verse">
stm32l1xx.h:266:22: fatal error: core_cm3.h: No such file or directory<br/>
&nbsp;&nbsp; #include "core_cm3.h"<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ^<br/>
compilation terminated.<br/>
</p>


<p>
Найдем этот хэдер и добавим путь к нему в ключи компилятора. Таким образом
компиляция теперь будет проходить при помощи команды:
</p>

<p class="verse">
arm-none-eabi-gcc -O0 -g -mcpu=cortex-m3 -c -o main.o main.c -Wall -mthumb \<br/>
&nbsp;&nbsp;&nbsp;&nbsp; -I path/to/STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Device/ST/STM32L1xx/Include/ \<br/>
&nbsp;&nbsp;&nbsp;&nbsp; -I../STM32L1_Discovery_Firmware_Pack_V1.0.3/Libraries/CMSIS/Include/<br/>
</p>


<p>
Благодаря чему мы можем переписать код в более понятном виде:
</p>



<pre class="example">#include &lt;stm32l1xx.h&gt;
#include &lt;stdint.h&gt;
#include &lt;stdbool.h&gt;
#define STACK_TOP 0x20004000 // End of memory

void nmi_handler (void);
void hardfault_handler (void);
void delay (void);
int main (void);

/* vector table, according to reference documentaion, occupied 61 pointer-sized cells  */
unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler
};

int
main (void)
{
  int n = 0;
  int i = 0;

  /* Enable GPIOA, GPIOB */
  RCC-&gt;AHBENR  |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN;
  /* Set GPIOB Pin 6 and Pin 7 to outputs */
  GPIOB-&gt;MODER |= GPIO_MODER_MODER6_0 | GPIO_MODER_MODER7_0;
  /* Set GPIOA Pin 0 to input */
  GPIOA-&gt;MODER &amp;= ~GPIO_MODER_MODER0;

  /* PB6 and PB7 is OFF */
  GPIOB-&gt;BSRRH |= 1 &lt;&lt; 6 | 1 &lt;&lt; 7; 


  while (1)
    {
      for (i = 0; i &lt; 800; i++)
        delay ();

      n++;                      /* Count the delays */
      if (n &amp; 1)                /* 1 / 1 ticks */
        {
          GPIOB-&gt;BSRRL = 1 &lt;&lt; 6;
        }
      else
        {
          GPIOB-&gt;BSRRH = 1 &lt;&lt; 6;
        }
      if ((n &amp; 2) &amp;&amp; ((GPIOA-&gt;IDR &amp; 1) == 0))  /* 2 / 2 ticks, but only when button not pressed */
        {
          GPIOB-&gt;BSRRL = 1 &lt;&lt; 7;
        }
      else
        {
          GPIOB-&gt;BSRRH = 1 &lt;&lt; 7;
        }
    }
}

void
delay (void)
{
  int i = 80;
  while (i-- &gt; 0)
    {
      asm ("nop");              /* This stops it optimising code out */
    }
}

void
nmi_handler (void)
{
  return;
}

void
hardfault_handler (void)
{
  return;
}
</pre>




<p>
Теперь код стал намного яснее и внимательный читатель сразу заметит, что в него
была добавлена обработка кнопки, которая в используемой отладочной плате
запаяна на PA0 пин. Следующим шагом станет попытка использовать прерывания.
</p>
</div>

</div>
