text.org
* Работа с кнопкой через прерывания.

Для того чтобы понять что нам конкретно нужно -- снова занимаемся перекрёстным
поиском по документации и доступным примерам к отладочной плате. Правильные
ключевые слова обнаружились в примере идущем с официальной библиотекой

#+BEGIN_VERSE
$ grep Button STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects/AN3964-Temperature_sensor/src/main.c
...
  /* Connect Button EXTI Line to Button GPIO Pin */
...
$
#+END_VERSE

Теперь понятно, что нам нужна документация к EXTI и мы сразу можем открывать в
reference документации соответствующий раздел. И видим описание как с этим
работать:

#+BEGIN_VERSE
• Configure the mask bits of the Interrupt lines (EXTI_IMR)
• Configure the Trigger Selection bits of the Interrupt lines (EXTI_RTSR and
   EXTI_FTSR)
• Configure the enable and mask bits that control the NVIC IRQ channel mapped to the
  external interrupt controller (EXTI) so that an interrupt coming from any one of the lines
  can be correctly acknowledged.
#+END_VERSE

Теперь сверяясь с исходником и описанием указанных регистров в документации
выполняем первые два пункта:

#+BEGIN_SRC c
void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA->MODER &= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG->EXTICR[0] &= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG->EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI->IMR |= 1;
  /* Send event when signal rising */
  EXTI->RTSR |= 1;
}
#+END_SRC

Теперь PA0 пин, на котором висит кнопка, настроен в качестве входа, системные
регистры соединили PA0 с EXTI0 контроллером внешних прерываний, а сам EXTI
настроен на генерацию прерываний каждый раз, когда сигнал на подключенных к нему
пинах растёт. Остаётся выполнить последний пункт из документации. 

Пришло время для поиска информации NVIC. В reference документации для
микроконтроллера можно найти очень мало: есть таблица прерываний, из которой мы
сразу можем понять, что нам в таблицу векторов необходимо добавить обработчик
прерываний, что прерывание для EXTI0 весит на IRQ6 и увидеть отсылку к "PM0056
programming manual".

Для начала зарегистрируем обработчик прерывания, не забывая сбрасывать
прерывание после его обработки, чтобы процессор не вызывал его вечно:

#+BEGIN_SRC c
unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler,
  [22] = (unsigned int *) set_button, /* EXTI0 interrupt */
};

bool button;

void
set_button ()
{
  button = !button;          // Change button state on button pressing

  if (EXTI->PR & (1<<0))
    {                        // EXTI0 interrupt pending?
      EXTI->PR |= (1<<0);    // clear pending interrupt
    }
}
#+END_SRC

И сразу же пойдём читать PM0056 (который гугл выдаст первой же строчкой в
поиске).  Из него мы можем выяснить, что регистры "Nested vectored interrupt
controller" лежат в памяти по адресам от 0xE000E100 до 0xE000E4EF и что для
включения соответствующего IRQ необходимо выставить нужный бит NVIC_ISERx
регистра:

#+BEGIN_SRC c
void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA->MODER &= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG->EXTICR[0] &= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG->EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI->IMR |= 1;
  /* Send event when signal rising */
  EXTI->RTSR |= 1;
  /* Enable IRQ 6 with NVIC Interrupt Set-Pending Register */
  NVIC->ISER[0] = (uint32_t)0x01 << 6;
}
#+END_SRC

После этого наше прерывание начинает работать как надо:

#+BEGIN_SRC c
#include <stm32l1xx.h>
#include <stdint.h>
#include <stdbool.h>
#define STACK_TOP 0x20004000 // End of memory

void nmi_handler (void);
void hardfault_handler (void);
void delay (void);
int main (void);
void set_button (void);

volatile bool button;

/* vector table, according to reference documentaion, occupied 61 pointer-sized cells  */
unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler,
  [22] = (unsigned int *) set_button /* EXTI0 interrupt */
};

void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA->MODER &= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG->EXTICR[0] &= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG->EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI->IMR |= 1;
  /* Send event when signal rising */
  EXTI->RTSR |= 1;
  /* Enable IRQ 6 with NVIC Interrupt Set-Pending Register */
  NVIC->ISER[0] = (uint32_t)0x01 << 6;
}

int
main (void)
{
  int n = 0;
  int i = 0;
  button = false;
 
  /* Enable GPIOA, GPIOB */
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN;
  /* Set GPIOB Pin 6 and Pin 7 to outputs */
  GPIOB->MODER |= GPIO_MODER_MODER6_0 | GPIO_MODER_MODER7_0;
  /* Set GPIOA Pin 0 to input */
  GPIOA->MODER &= ~GPIO_MODER_MODER0;

  /* PB6 and PB7 is OFF */
  GPIOB->BSRRH |= 1 << 6 | 1 << 7; 

  configure_exti0_to_pa0 ();

  while (1)
    {
      for (i = 0; i < 800; i++)
	delay ();

      n++;			/* Count the delays */
      if (n & 1)		/* 1 / 1 ticks */
      	{
      	  GPIOB->BSRRL = 1 << 6;
      	}
      else
      	{
      	  GPIOB->BSRRH = 1 << 6;
      	}

      if (button)  /* change depend on button flag */
      	{
      	  GPIOB->BSRRL = 1 << 7;
      	}
      else
      	{
      	  GPIOB->BSRRH = 1 << 7;
      	}
    }
}

void
delay (void)
{
  int i = 80;
  while (i-- > 0)
    {
      asm ("nop");		/* This stops it optimising code out */
    }
}

void
set_button ()
{
  button = !button;

  if (EXTI->PR & (1<<0))
    {                        // EXTI0 interrupt pending?
      EXTI->PR |= (1<<0);    // clear pending interrupt
    }
}


void
nmi_handler (void)
{
  return;
}

void
hardfault_handler (void)
{
  return;
}
#+END_SRC

Теперь мы можем кнопкой менять состояние зелёного диода, в то время как синий
постоянно мигает.

