text.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Работа с кнопкой через прерывания. </h2>
<div class="outline-text-2" id="text-5">


<p>
Для того чтобы понять что нам конкретно нужно &ndash; снова занимаемся перекрёстным
поиском по документации и доступным примерам к отладочной плате. Правильные
ключевые слова обнаружились в примере идущем с официальной библиотекой
</p>

<p class="verse">
$ grep Button STM32L1_Discovery_Firmware_Pack_V1.0.3/Projects/AN3964-Temperature_sensor/src/main.c<br/>
&hellip;<br/>
&nbsp;&nbsp;&nbsp;&nbsp; <i>* Connect Button EXTI Line to Button GPIO Pin *</i><br/>
&hellip;<br/>
$<br/>
</p>


<p>
Теперь понятно, что нам нужна документация к EXTI и мы сразу можем открывать в
reference документации соответствующий раздел. И видим описание как с этим
работать:
</p>

<p class="verse">
• Configure the mask bits of the Interrupt lines (EXTI_IMR)<br/>
• Configure the Trigger Selection bits of the Interrupt lines (EXTI_RTSR and<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; EXTI_FTSR)<br/>
• Configure the enable and mask bits that control the NVIC IRQ channel mapped to the<br/>
&nbsp;&nbsp;&nbsp;&nbsp; external interrupt controller (EXTI) so that an interrupt coming from any one of the lines<br/>
&nbsp;&nbsp;&nbsp;&nbsp; can be correctly acknowledged.<br/>
</p>


<p>
Теперь сверяясь с исходником и описанием указанных регистров в документации
выполняем первые два пункта:
</p>



<pre class="example">void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC-&gt;AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA-&gt;MODER &amp;= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA-&gt;OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG-&gt;EXTICR[0] &amp;= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG-&gt;EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI-&gt;IMR |= 1;
  /* Send event when signal rising */
  EXTI-&gt;RTSR |= 1;
}
</pre>




<p>
Теперь PA0 пин, на котором висит кнопка, настроен в качестве входа, системные
регистры соединили PA0 с EXTI0 контроллером внешних прерываний, а сам EXTI
настроен на генерацию прерываний каждый раз, когда сигнал на подключенных к нему
пинах растёт. Остаётся выполнить последний пункт из документации. 
</p>
<p>
Пришло время для поиска информации NVIC. В reference документации для
микроконтроллера можно найти очень мало: есть таблица прерываний, из которой мы
сразу можем понять, что нам в таблицу векторов необходимо добавить обработчик
прерываний, что прерывание для EXTI0 весит на IRQ6 и увидеть отсылку к "PM0056
programming manual".
</p>
<p>
Для начала зарегистрируем обработчик прерывания, не забывая сбрасывать
прерывание после его обработки, чтобы процессор не вызывал его вечно:
</p>



<pre class="example">unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler,
  [22] = (unsigned int *) set_button, /* EXTI0 interrupt */
};

bool button;

void
set_button ()
{
  button = !button;          // Change button state on button pressing

  if (EXTI-&gt;PR &amp; (1&lt;&lt;0))
    {                        // EXTI0 interrupt pending?
      EXTI-&gt;PR |= (1&lt;&lt;0);    // clear pending interrupt
    }
}
</pre>




<p>
И сразу же пойдём читать PM0056 (который гугл выдаст первой же строчкой в
поиске).  Из него мы можем выяснить, что регистры "Nested vectored interrupt
controller" лежат в памяти по адресам от 0xE000E100 до 0xE000E4EF и что для
включения соответствующего IRQ необходимо выставить нужный бит NVIC_ISERx
регистра:
</p>



<pre class="example">void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC-&gt;AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA-&gt;MODER &amp;= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA-&gt;OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG-&gt;EXTICR[0] &amp;= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG-&gt;EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI-&gt;IMR |= 1;
  /* Send event when signal rising */
  EXTI-&gt;RTSR |= 1;
  /* Enable IRQ 6 with NVIC Interrupt Set-Pending Register */
  NVIC-&gt;ISER[0] = (uint32_t)0x01 &lt;&lt; 6;
}
</pre>




<p>
После этого наше прерывание начинает работать как надо:
</p>



<pre class="example">#include &lt;stm32l1xx.h&gt;
#include &lt;stdint.h&gt;
#include &lt;stdbool.h&gt;
#define STACK_TOP 0x20004000 // End of memory

void nmi_handler (void);
void hardfault_handler (void);
void delay (void);
int main (void);
void set_button (void);

volatile bool button;

/* vector table, according to reference documentaion, occupied 61 pointer-sized cells  */
unsigned int *myvectors[61] __attribute__ ((section ("vectors"))) =
{
  [0]  = (unsigned int *) STACK_TOP,
  [1]  = (unsigned int *) main,
  [2]  = (unsigned int *) nmi_handler,
  [3]  = (unsigned int *) hardfault_handler,
  [22] = (unsigned int *) set_button /* EXTI0 interrupt */
};

void
configure_exti0_to_pa0 (void)
{
  /* Enable GPIOA on case if it's not enabled */
  RCC-&gt;AHBENR  |= RCC_AHBENR_GPIOAEN;
  /* Set GPIOA Pin 0 to input floating */
  GPIOA-&gt;MODER &amp;= ~GPIO_MODER_MODER0;
  /* Set speed to 40 MHz */
  GPIOA-&gt;OSPEEDR |= GPIO_OSPEEDER_OSPEEDR0;
  /* Connect PA0 to EXTI0 line */
  SYSCFG-&gt;EXTICR[0] &amp;= ~0xF; // clean all connected to EXTI0 pins
  SYSCFG-&gt;EXTICR[0] |= 0;    // Connect with PA
  /* Enable interrupts on EXTI0 */
  EXTI-&gt;IMR |= 1;
  /* Send event when signal rising */
  EXTI-&gt;RTSR |= 1;
  /* Enable IRQ 6 with NVIC Interrupt Set-Pending Register */
  NVIC-&gt;ISER[0] = (uint32_t)0x01 &lt;&lt; 6;
}

int
main (void)
{
  int n = 0;
  int i = 0;
  button = false;
 
  /* Enable GPIOA, GPIOB */
  RCC-&gt;AHBENR  |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN;
  /* Set GPIOB Pin 6 and Pin 7 to outputs */
  GPIOB-&gt;MODER |= GPIO_MODER_MODER6_0 | GPIO_MODER_MODER7_0;
  /* Set GPIOA Pin 0 to input */
  GPIOA-&gt;MODER &amp;= ~GPIO_MODER_MODER0;

  /* PB6 and PB7 is OFF */
  GPIOB-&gt;BSRRH |= 1 &lt;&lt; 6 | 1 &lt;&lt; 7; 

  configure_exti0_to_pa0 ();

  while (1)
    {
      for (i = 0; i &lt; 800; i++)
        delay ();

      n++;                      /* Count the delays */
      if (n &amp; 1)                /* 1 / 1 ticks */
        {
          GPIOB-&gt;BSRRL = 1 &lt;&lt; 6;
        }
      else
        {
          GPIOB-&gt;BSRRH = 1 &lt;&lt; 6;
        }

      if (button)  /* change depend on button flag */
        {
          GPIOB-&gt;BSRRL = 1 &lt;&lt; 7;
        }
      else
        {
          GPIOB-&gt;BSRRH = 1 &lt;&lt; 7;
        }
    }
}

void
delay (void)
{
  int i = 80;
  while (i-- &gt; 0)
    {
      asm ("nop");              /* This stops it optimising code out */
    }
}

void
set_button ()
{
  button = !button;

  if (EXTI-&gt;PR &amp; (1&lt;&lt;0))
    {                        // EXTI0 interrupt pending?
      EXTI-&gt;PR |= (1&lt;&lt;0);    // clear pending interrupt
    }
}


void
nmi_handler (void)
{
  return;
}

void
hardfault_handler (void)
{
  return;
}
</pre>




<p>
Теперь мы можем кнопкой менять состояние зелёного диода, в то время как синий
постоянно мигает.
</p>
</div>

</div>
