text.org
* Навешивание внешнего оборудования

Следующим шагом было решено вынуть LCD экран, поскольку на отладочной плате он
занимал 28 пинов и не оставлял нам никаких UART портов, на которых в сети
советуют реализовывать 1 Wire протокол, используемый купленным мной датчиком
температуры. Также LCD экран занимал все пины умеющие работать с таймером, а их
хочется для генерации PWM сигнала, который управляет сервоприводом. А все
указанные внешние устройства необходимы для реализации оригинальной задумки
(смотри первый абзац документа).

Вместо LCD экрана был использован трёх символьный семи сегментный LED экран
BA56-12GWA с общим анодом.

Здесь надо объяснить что такое экран с общим катодом и что такое экран с общим
анодом:

Для того чтобы загорелся сегмент диодного экрана -- надо подать напряжение одну
ногу диода и соединить вторую ногу диода с землёй. Та нога, на которую подаётся
напряжение, называется анодом, а та, которая соединяется с землёй --
катодом. Если у нас в руках экран с общим катодом, то выходы, которые должны
идти на землю с каждого из диодов экрана -- соединены в одну ногу. Эту ногу
можно соединить с землёй, а подавая сигналы на семь оставшихся -- зажигать
соответствующие диоды в экране.

# TODO : Добавить картинку

В случае общего анода мы действуем наоборот: на общую ногу подаём напряжение,
а, для того чтобы зажечь конкретный сегмент (диод) экрана -- соединяем вторую
ногу данного диода с землёй.

** LED экран
При работе со светодиодным экраном нужно помнить следующее:
 + Если мы обе ноги диода подключаем к GPIO пинам, то оба пина надо настроить в
   output режим, после чего для включения диода надо послать 1 на пин, к
   которому подключён анод и 0 на пин к которому подключён катод.
 + Для того чтобы отобразить на экране состоящем из нескольких цифр несколько
   _разных_ цифр -- надо просто очень быстро по очереди включать по одной цифре.

** Подключение светодиодов
И последнее это вопрос с, собственно, подключением. В интернете постоянно
пишут, что светодиоды надо подключать через резисторы. Собственно какой в этом
смысл: в описании к светодиоду пишут что-то вроде "Forward voltage = 3.2V,
Forward Current = 20mA" -- это значит, что при напряжении 3.2 вольта он будет
потреблять 20 mA и нормально работать. Если же напряжение подать выше, то в
соответствии с законом ома чтобы сила тока не выросла -- надо добавить резистор
с подходящим сопротивлением, иначе диод может сгореть.

Если же у вас диод рассчитанный на 3.2 вольта, то его можно без опасений
подключать напрямую к пинам платы, на которые будет подано напряжение в те же
самые 3.2 вольта.

