text.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Навешивание внешнего оборудования </h2>
<div class="outline-text-2" id="text-6">


<p>
Следующим шагом было решено вынуть LCD экран, поскольку на отладочной плате он
занимал 28 пинов и не оставлял нам никаких UART портов, на которых в сети
советуют реализовывать 1 Wire протокол, используемый купленным мной датчиком
температуры. Также LCD экран занимал все пины умеющие работать с таймером, а их
хочется для генерации PWM сигнала, который управляет сервоприводом. А все
указанные внешние устройства необходимы для реализации оригинальной задумки
(смотри первый абзац документа).
</p>
<p>
Вместо LCD экрана был использован трёх символьный семи сегментный LED экран
BA56-12GWA с общим анодом.
</p>
<p>
Здесь надо объяснить что такое экран с общим катодом и что такое экран с общим
анодом:
</p>
<p>
Для того чтобы загорелся сегмент диодного экрана &ndash; надо подать напряжение одну
ногу диода и соединить вторую ногу диода с землёй. Та нога, на которую подаётся
напряжение, называется анодом, а та, которая соединяется с землёй --
катодом. Если у нас в руках экран с общим катодом, то выходы, которые должны
идти на землю с каждого из диодов экрана &ndash; соединены в одну ногу. Эту ногу
можно соединить с землёй, а подавая сигналы на семь оставшихся &ndash; зажигать
соответствующие диоды в экране.
</p>

<p>
В случае общего анода мы действуем наоборот: на общую ногу подаём напряжение,
а, для того чтобы зажечь конкретный сегмент (диод) экрана &ndash; соединяем вторую
ногу данного диода с землёй.
</p>

</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1"><span class="section-number-3">6.1</span> LED экран </h3>
<div class="outline-text-3" id="text-6.1">

<p>При работе со светодиодным экраном нужно помнить следующее:
</p><ul>
<li>
Если мы обе ноги диода подключаем к GPIO пинам, то оба пина надо настроить в
output режим, после чего для включения диода надо послать 1 на пин, к
которому подключён анод и 0 на пин к которому подключён катод.
</li>
<li>
Для того чтобы отобразить на экране состоящем из нескольких цифр несколько
<span style="text-decoration:underline;">разных</span> цифр &ndash; надо просто очень быстро по очереди включать по одной цифре.

</li>
</ul>
</div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2"><span class="section-number-3">6.2</span> Подключение светодиодов </h3>
<div class="outline-text-3" id="text-6.2">

<p>И последнее это вопрос с, собственно, подключением. В интернете постоянно
пишут, что светодиоды надо подключать через резисторы. Собственно какой в этом
смысл: в описании к светодиоду пишут что-то вроде "Forward voltage = 3.2V,
Forward Current = 20mA" &ndash; это значит, что при напряжении 3.2 вольта он будет
потреблять 20 mA и нормально работать. Если же напряжение подать выше, то в
соответствии с законом ома чтобы сила тока не выросла &ndash; надо добавить резистор
с подходящим сопротивлением, иначе диод может сгореть.
</p>
<p>
Если же у вас диод рассчитанный на 3.2 вольта, то его можно без опасений
подключать напрямую к пинам платы, на которые будет подано напряжение в те же
самые 3.2 вольта.
</p>
</div>
</div>

</div>
